#include <stdio.h>

int main(int argc, char const *argv[])
{
    int i;
    printf("Please enter:");
    scanf("%d", &i);
    printf("*%#4x*\n", i);                                    // 打印"0x"形式的最小字段宽度为4的16进制整型（打印输出的字段宽度为4，数字位数为2）
    printf("*%#.4x*\n", i);                                   // 打印"0x"形式的最小数字位数为4的16进制整型（打印输出的字段宽度为6，数字位数为4）
    printf("*%#4.4x*\n", i);                                  // 打印"0x"形式的最小字段宽度和最小数字位数均为4的16进制整型（打印输出的字段宽度为6，数字位数为4）
    printf("*%#8.4x*\n", i);                                  // 打印"0x"形式的最小字段宽度为8，最小数字位数为4的16进制整型（打印输出的字段宽度为8，数字位数为4）
    printf("*%-#8.4x*, occupied %zd bytes.\n", i, sizeof(i)); // 打印"0x"形式的最小字段宽度为8，最小数字位数为4的16进制整型（打印输出的字段宽度为8，数字位数为4）
    printf("*%+#8.4x*\n", i);
    return 0;
}
